<?xml version="1.0" encoding="utf-8"?>
<!--  (c) 2022 Microsoft Corporation  -->
<policyDefinitions xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" revision="1.0" schemaVersion="1.0" xmlns="http://schemas.microsoft.com/GroupPolicy/2006/07/PolicyDefinitions">

  <policyNamespaces>
    <target prefix="WebThreatDefense" namespace="Microsoft.Policies.WebThreatDefense" />
    <using prefix="windows" namespace="Microsoft.Policies.Windows" />
    <using prefix="smartscreen" namespace="Microsoft.Policies.SmartScreen" />
  </policyNamespaces>

  <resources minRequiredRevision="1.0" />

    <categories>
      <category name="WebThreatDefense" displayName="$(string.WebThreatDefense)">
        <parentCategory ref="smartscreen:SmartScreen" />
      </category>
    </categories>

  <policies>
    <policy name="ServiceEnabled" class="Machine" displayName="$(string.ServiceEnabled)" key="Software\Policies\Microsoft\Windows\WTDS\Components" valueName="ServiceEnabled" explainText="$(string.ServiceEnabled_Help)">
      <parentCategory ref="WebThreatDefense" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="NotifyMalicious" class="Machine" displayName="$(string.NotifyMalicious)" key="Software\Policies\Microsoft\Windows\WTDS\Components" valueName="NotifyMalicious" explainText="$(string.NotifyMalicious_Help)">
      <parentCategory ref="WebThreatDefense" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="NotifyPasswordReuse" class="Machine" displayName="$(string.NotifyPasswordReuse)" key="Software\Policies\Microsoft\Windows\WTDS\Components" valueName="NotifyPasswordReuse" explainText="$(string.NotifyPasswordReuse_Help)">
      <parentCategory ref="WebThreatDefense" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="NotifyUnsafeApp" class="Machine" displayName="$(string.NotifyUnsafeApp)" key="Software\Policies\Microsoft\Windows\WTDS\Components" valueName="NotifyUnsafeApp" explainText="$(string.NotifyUnsafeApp_Help)">
      <parentCategory ref="WebThreatDefense" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>

    <policy name="CaptureThreatWindow" class="Machine" displayName="$(string.CaptureThreatWindow)" key="Software\Policies\Microsoft\Windows\WTDS\Components" valueName="CaptureThreatWindow" explainText="$(string.CaptureThreatWindow_Help)">
      <parentCategory ref="WebThreatDefense" />
      <supportedOn ref="windows:SUPPORTED_Windows_11_0_22H2" />
      <enabledValue>
        <decimal value="1" />
      </enabledValue>
      <disabledValue>
        <decimal value="0" />
      </disabledValue>
    </policy>
  </policies>
</policyDefinitions>
